<?php 
    $x = 10;
    $y = 5;

    //เพิ่มค่า

    echo "ค่าเริ่มต้นของ x = ".$x."<br>";  //10
    echo "เพิ่มค่าแบบ prefix = ".(++$x)."<br>";  //11
    echo "ค่าล่าสุดของ x = ".$x."<br>"; //11
    echo "<hr>";

    echo "ค่าเริ่มต้นของ x = ".$x."<br>";  //11
    echo "เพิ่มค่าแบบ postfix = ".($x++)."<br>";  //11
    echo "ค่าล่าสุดของ x = ".$x."<br>"; //12
    echo "<hr>";

    //ลดค่า
    echo "ค่าเริ่มต้นของ y = ".$y."<br>";  //5
    echo "ลดค่าแบบ prefix = ".(--$y)."<br>";  //4
    echo "ค่าล่าสุดของ y = ".$y."<br>"; //4
    echo "<hr>";

    echo "ค่าเริ่มต้นของ y = ".$y."<br>";  //4
    echo "ลดค่าแบบ postfix = ".($y--)."<br>";  //4
    echo "ค่าล่าสุดของ y = ".$y."<br>"; //3
    echo "<hr>";
?>