<?php 
    // if แบบหลายเงื่อนไข
    //โปรแกรมตัดเกรด
    // เงื่อนไขที่ 1 ถ้าได้คะแนน 0 - 49 แสดงข้อความ เกรด F
    // เงื่อนไขที่ 2 ถ้าได้คะแนน 50 - 59 แสดงข้อความ เกรด D
    // เงื่อนไขที่ 3 ถ้าได้คะแนน 60 - 69 แสดงข้อความ เกรด C
    // เงื่อนไขที่ 4 ถ้าได้คะแนน 70 - 79 แสดงข้อความ เกรด B
    // เงื่อนไขที่ 5 ถ้าได้คะแนน 80 - 100 แสดงข้อความ เกรด A
    // ถ้าไม่กรอกคะแนน 0-100 ให้แสดงข้อความว่า ผู้ใช้กรอกข้อมูลไม่ถูกต้อง

    $scroe =  70;

    if($scroe>=0 && $scroe<=49){    //เงื่อนไขที่1
        echo "เกรด F";
    }elseif($scroe>=50 && $scroe<=59){      //เงื่อนไขที่2
        echo "เกรด D";
    }elseif($scroe>=60 && $scroe<=69){      //เงื่อนไขที่3
        echo "เกรด C";
    }elseif($scroe>=70 && $scroe<=79){      //เงื่อนไขที่4
        echo "เกรด B";
    }elseif($scroe>=80 && $scroe<=100){      //เงื่อนไขที่5
        echo "เกรด A";
    }else{
        echo "ผู้ใช้กรอกข้อมูลไม่ถูกต้อง";
    }
?>